nxp-mcuxpresso/mcux-sdk-examples/evkbmimxrt1170/edgefast_bluetooth_examples/call_gateway/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitM2UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B6, peripheral: LPUART2, signal: CTS_B, pin_signal: GPIO_DISP_B2_12, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: A5, peripheral: LPUART2, signal: RTS_B, pin_signal: GPIO_DISP_B2_13, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: D9, peripheral: LPUART2, signal: TXD, pin_signal: GPIO_DISP_B2_10, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: A6, peripheral: LPUART2, signal: RXD, pin_signal: GPIO_DISP_B2_11, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitM2UARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitM2UARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD,     /* GPIO_DISP_B2_10 is configured as LPUART2_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD,     /* GPIO_DISP_B2_11 is configured as LPUART2_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_12_LPUART2_CTS_B,   /* GPIO_DISP_B2_12 is configured as LPUART2_CTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_13_LPUART2_RTS_B,   /* GPIO_DISP_B2_13 is configured as LPUART2_RTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD,     /* GPIO_DISP_B2_10 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD,     /* GPIO_DISP_B2_11 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_12_LPUART2_CTS_B,   /* GPIO_DISP_B2_12 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_13_LPUART2_RTS_B,   /* GPIO_DISP_B2_13 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitM2ScoPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T2, peripheral: SAI3, signal: sai_mclk, pin_signal: GPIO_EMC_B2_17, software_input_on: Enable, pull_down_pull_up_config: Pull_Down}
  - {pin_num: M4, peripheral: SAI3, signal: sai_tx_data, pin_signal: GPIO_EMC_B2_14, software_input_on: Enable, pull_down_pull_up_config: Pull_Down}
  - {pin_num: K5, peripheral: SAI3, signal: sai_rx_data, pin_signal: GPIO_EMC_B2_13, software_input_on: Enable, pull_down_pull_up_config: Pull_Down}
  - {pin_num: L2, peripheral: SAI3, signal: sai_tx_bclk, pin_signal: GPIO_EMC_B2_15, software_input_on: Enable, pull_down_pull_up_config: Pull_Down}
  - {pin_num: P2, peripheral: SAI3, signal: sai_tx_sync, pin_signal: GPIO_EMC_B2_16, software_input_on: Enable, pull_down_pull_up_config: Pull_Down}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

