nxp-mcuxpresso/mcux-sdk-examples/evkbmimxrt1170/edgefast_bluetooth_examples/call_gateway/cm7/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitM2ScoPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitM2ScoPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_13_SAI3_RX_DATA,     /* GPIO_EMC_B2_13 is configured as SAI3_RX_DATA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_13 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_14_SAI3_TX_DATA,     /* GPIO_EMC_B2_14 is configured as SAI3_TX_DATA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_14 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_15_SAI3_TX_BCLK,     /* GPIO_EMC_B2_15 is configured as SAI3_TX_BCLK */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_15 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_16_SAI3_TX_SYNC,     /* GPIO_EMC_B2_16 is configured as SAI3_TX_SYNC */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_16 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_17_SAI3_MCLK,        /* GPIO_EMC_B2_17 is configured as SAI3_MCLK */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_17 */
  IOMUXC_GPR->GPR2 = ((IOMUXC_GPR->GPR2 &
    (~(IOMUXC_GPR_GPR2_SAI3_MCLK_DIR_MASK)))  /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR2_SAI3_MCLK_DIR(0x01U)  /* SAI3_MCLK signal direction control: 0x01U */
    );
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_13_SAI3_RX_DATA,     /* GPIO_EMC_B2_13 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_14_SAI3_TX_DATA,     /* GPIO_EMC_B2_14 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_15_SAI3_TX_BCLK,     /* GPIO_EMC_B2_15 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_16_SAI3_TX_SYNC,     /* GPIO_EMC_B2_16 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_17_SAI3_MCLK,        /* GPIO_EMC_B2_17 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCodecPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N8, peripheral: LPI2C5, signal: SCL, pin_signal: GPIO_LPSR_05, software_input_on: Enable, pull_up_down_config: Pull_Up}
  - {pin_num: N7, peripheral: LPI2C5, signal: SDA, pin_signal: GPIO_LPSR_04, software_input_on: Enable, pull_up_down_config: Pull_Up}
  - {pin_num: N15, peripheral: SAI1, signal: sai_mclk, pin_signal: GPIO_AD_17, software_input_on: Enable, pull_keeper_select: Keeper}
  - {pin_num: K13, peripheral: SAI1, signal: sai_rx_data00, pin_signal: GPIO_AD_20, software_input_on: Enable}
  - {pin_num: K14, peripheral: SAI1, signal: sai_tx_data00, pin_signal: GPIO_AD_21, software_input_on: Enable, pull_keeper_select: Keeper}
  - {pin_num: K12, peripheral: SAI1, signal: sai_tx_bclk, pin_signal: GPIO_AD_22, software_input_on: Enable, pull_keeper_select: Keeper}
  - {pin_num: J12, peripheral: SAI1, signal: sai_tx_sync, pin_signal: GPIO_AD_23, software_input_on: Enable, pull_keeper_select: Keeper}
  - {pin_num: T5, peripheral: ARM, signal: arm_trace_swo, pin_signal: GPIO_LPSR_11, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

